// # 📝 [LV 2] H-Index
// ---

// H-Index는 과학자의 생산성과 영향력을 나타내는 지표입니다. 어느 과학자의 H-Index를 나타내는 값인 h를 구하려고 합니다. 위키백과1에 따르면, H-Index는 다음과 같이 구합니다.

// 어떤 과학자가 발표한 논문 n편 중, h번 이상 인용된 논문이 h편 이상이고 나머지 논문이 h번 이하 인용되었다면 h의 최댓값이 이 과학자의 H-Index입니다.

// 어떤 과학자가 발표한 논문의 인용 횟수를 담은 배열 citations가 매개변수로 주어질 때, 이 과학자의 H-Index를 return 하도록 solution 함수를 작성해주세요.

// ### 제한사항
// - 과학자가 발표한 논문의 수는 1편 이상 1,000편 이하입니다.
// - 논문별 인용 횟수는 0회 이상 10,000회 이하입니다.

// ## ▷ 입출력 예

// ```jsx
// solution([3, 0, 6, 1, 5]) // 3
// ```

// ## ▷ 내 풀이

// ```jsx
// function solution(citations) {
//   let answer = 0;
//   citations.sort((a,b)=>{
//     return b-a;
//   });
//   for(let i = 0 ; i < citations.length; i++) {
//     if(i + 1 <= citations[i]) {
//       answer++;
//     }
//   }
//   return answer;
// }
// ```

// ## ▷ 접근 방식
// 처음에는 문제가 이해가 안되어서 되게 어려운 문제라고 생각했지만 힌트를 얻기위해서 구글링을 해보니까 문제자체가 설명이 부족하다는 평이 많았다. 그래서 나는 [H-index 쉬운 설명](https://www.ibric.org/myboard/read.php?Board=news&id=270333) 을 보고 풀이했다.

// ---
// >
// 출처: [프로그래머스](https://programmers.co.kr/)
// >
